dev/vllm/benchmarks/phase1-baseline-rerun/20260225-010006/rate-1.0.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f0d31dbc220>, seed=0, num_prompts=300, dataset_name='sharegpt', no_stream=False, dataset_path='/models/benchmarks/conversations-sharegpt-20260224-205203.json', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/nvidia/Llama-3.1-70B-Instruct-FP8', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/models/benchmarks/phase1-baseline-rerun/20260225-010006', result_filename='rate-1.0.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-a0566cd6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 300/300 [05:20<00:00,  1.07s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  320.40    
Total input tokens:                      1741762   
Total generated tokens:                  155797    
Request throughput (req/s):              0.94      
Output token throughput (tok/s):         486.26    
Peak output token throughput (tok/s):    751.00    
Peak concurrent requests:                28.00     
Total token throughput (tok/s):          5922.55   
---------------Time to First Token----------------
Mean TTFT (ms):                          181.52    
Median TTFT (ms):                        104.75    
P50 TTFT (ms):                           104.75    
P95 TTFT (ms):                           511.25    
P99 TTFT (ms):                           698.06    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.62     
Median TPOT (ms):                        36.95     
P50 TPOT (ms):                           36.95     
P95 TPOT (ms):                           40.10     
P99 TPOT (ms):                           40.92     
---------------Inter-token Latency----------------
Mean ITL (ms):                           34.66     
Median ITL (ms):                         35.14     
P50 ITL (ms):                            35.14     
P95 ITL (ms):                            36.82     
P99 ITL (ms):                            48.00     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          18146.34  
Median E2EL (ms):                        19056.89  
P50 E2EL (ms):                           19056.89  
P95 E2EL (ms):                           39405.53  
P99 E2EL (ms):                           41155.12  
==================================================