dev/vllm/benchmarks/phase1-baseline-rerun/20260225-010006/rate-2.0.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fdb51738220>, seed=0, num_prompts=300, dataset_name='sharegpt', no_stream=False, dataset_path='/models/benchmarks/conversations-sharegpt-20260224-205203.json', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/nvidia/Llama-3.1-70B-Instruct-FP8', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/models/benchmarks/phase1-baseline-rerun/20260225-010006', result_filename='rate-2.0.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-9c6ffdbf-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 300/300 [02:58<00:00,  1.68it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  178.90    
Total input tokens:                      1741762   
Total generated tokens:                  155012    
Request throughput (req/s):              1.68      
Output token throughput (tok/s):         866.47    
Peak output token throughput (tok/s):    1361.00   
Peak concurrent requests:                58.00     
Total token throughput (tok/s):          10602.45  
---------------Time to First Token----------------
Mean TTFT (ms):                          228.71    
Median TTFT (ms):                        128.41    
P50 TTFT (ms):                           128.41    
P95 TTFT (ms):                           580.17    
P99 TTFT (ms):                           1009.65   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          43.14     
Median TPOT (ms):                        44.48     
P50 TPOT (ms):                           44.48     
P95 TPOT (ms):                           47.44     
P99 TPOT (ms):                           47.84     
---------------Inter-token Latency----------------
Mean ITL (ms):                           43.02     
Median ITL (ms):                         37.84     
P50 ITL (ms):                            37.84     
P95 ITL (ms):                            43.19     
P99 ITL (ms):                            227.42    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          22412.83  
Median E2EL (ms):                        23112.29  
P50 E2EL (ms):                           23112.29  
P95 E2EL (ms):                           46564.51  
P99 E2EL (ms):                           48346.68  
==================================================